# 1. Вказуємо базовий образ (Node.js 18)
FROM node

# 2. Встановлюємо робочу директорію всередині контейнера
WORKDIR /project-name

# 3. Копіюємо package.json і package-lock.json (щоб не качати залежності при кожному копіюванні коду)
COPY package*.json ./

# 4. Встановлюємо залежності
RUN npm install

# 5. Копіюємо всі файли проєкту в контейнер
COPY . .

# 6. Відкриваємо порт 3000 (або інший, який використовує NestJS)
EXPOSE 3000

# 7. Команда для запуску проєкту (NestJS у продакшені треба запускати через "start:prod")
CMD ["npm", "run", "start"]
